<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current release version of HandBrake.</string>
        <key>Identifier</key>
        <string>com.github.serrc-techops.download.HandBrake</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>HandBrake</string>
        </dict>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://handbrake.fr/appcast.x86_64.xml</string>
                    <key>re_pattern</key>
                    <string>handbrake.fr/rotation.php\?file=HandBrake-[0-9].*\.dmg</string>
                    
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%match%</string>
                    <key>re_pattern</key>
                    <string>href="(?P&lt;url&gt;https://download.handbrake.fr/releases/[0-9].*/HandBrake-[0-9].*\.dmg)"</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%.dmg</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>
