<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Comment</key>
		<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
		<key>Description</key>
		<string>Downloads the latest version of CrisisGo and imports it into Munki.</string>
		<key>Identifier</key>
		<string>com.github.serrc-techops.munki.CrisisGo</string>
		<key>Input</key>
		<dict>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>%NAME%</string>
			<key>NAME</key>
			<string>CrisisGo</string>
			<key>pkginfo</key>
			<dict>
				<key>blocking_applications</key>
				<array>
					<string>CrisisGo.app</string>
				</array>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>description</key>
				<string>CrisisGo keeps people safer at school, at work, at home, and at play by putting a safety assistant on everyone's smartphone, tablet or computer.</string>
				<key>developer</key>
				<string>The Tech Road, Inc.</string>
				<key>display_name</key>
				<string>CrisisGo</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.serrc-techops.download.CrisisGo</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pathname%</string>
				</dict>
				<key>Processor</key>
				<string>CrisisGoVersionFixer</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>source_pkg</key>
					<string>%pathname%</string>
					<key>pkg_path</key>
					<string>/tmp/tempPackage.pkg</string>
				</dict>
				<key>Processor</key>
				<string>PkgCopier</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pkg_path%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%pkg_path%</string>
					</array>
				</dict>
				<key>Processor</key>
				<string>PathDeleter</string>
			</dict>
		</array>
	</dict>
</plist>
