<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current release version of Audacity.</string>
        <key>Identifier</key>
        <string>com.github.serrc-techops.download.Audacity</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Audacity</string>
        </dict>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://www.fosshub.com/Audacity.html</string>
                    <key>re_pattern</key>
                    <string>https://www.fosshub.com/Audacity.html\?dwl=audacity-macos-[0-9]\.[0-9]\.[0-9]\.dmg</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%.dmg</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>
