<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>TechopsTeamViewerQS.munki.3CXDesktopApp</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>app</string>
		<key>NAME</key>
		<string>3CXDesktopApp</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string></string>
                        <key>blocking_applications</key>
                        <array>
                                <string>3CX Desktop App</string>
                        </array>
                        <key>category</key>
                        <string>Communication</string>
			<key>developer</key>
			<string>3CX</string>
			<key>display_name</key>
			<string>3CX Desktop App</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
                        <key>notes</key>
                        <string>Updated via AutoPkg</string>
                        <key>icon_name</key>
                        <string>3CXDesktopApp.png</string>
                        <key>minimum_os_version</key>
                        <string>10.11</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>TechopsTeamViewerQS.download.3CXDesktopApp</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
