<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the current release x86_64 version of GeoDa and imports into Munki.</string>
		<key>Identifier</key>
		<string>com.github.serrc-techops.munki.GeoDa-x86_64</string>
		<key>Input</key>
		<dict>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>app</string>
			<key>NAME</key>
			<string>GeoDa</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>description</key>
				<string>An open source application designed to implement techniques for exploratory spatial data analysis (ESDA) on lattice data (points and polygons).</string>
				<key>display_name</key>
				<string>GeoDa (Intel)</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
				<key>unattended_uninstall</key>
				<true/>
				<key>icon_name</key>
				<string>GeoDa.png</string>
				<key>notes</key>
				<string>Updated via AutoPkg</string>
				<key>installable_condition</key>
				<string>arch == "x86_64"</string>
			</dict>
		</dict>
		<key>ParentRecipe</key>
		<string>com.github.serrc-techops.download.GeoDa-x86_64</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pathname%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
		</array>
	</dict>
</plist>
