<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Kite Student Portal and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.serrc-techops.munki.KiteStudentPortal</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>app</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>The Kite Suite provides an online testing interface for students that includes practice items.</string>
			<key>developer</key>
			<string></string>
			<key>category</key>
			<string>Education</string>
			<key>notes</key>
			<string>Updated via AutoPkg</string>
			<key>developer</key>
			<string>DLM</string>
			<key>display_name</key>
			<string>Kite Student Portal</string>
			<key>name</key>
			<string>kiteclient</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
			<key>icon_name</key>
			<string>KiteStudentPortal.png</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.serrc-techops.download.KiteStudentPortal</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_makepkginfo_options</key>
				<array>
					<string>--pkgvers=%version%</string>
				</array>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
